#language: ru
Функционал: Вклады

  Сценарий: Сценарий 1
    * Перейти по ссылке - https://rencredit.ru
    * Перейти в меню "Вклады"
    * Выбрать валюту – "Рубли"
    * Сумма вклада – "300000"
    * Срок вклада в месяцах - "6"
    * Ежемесячное пополнение на сумму - "50000"
    * Отметить чекбокс – "Ежемесячная капитализация"
    * Проверить что автоматически заполнилось поле Ставка - "5.90%"
    * Проверить что автоматически заполнилось поле Начислено - "12 566,02"
    * Проверить что автоматически заполнилось поле Пополнение за 6 месяцев - "250 000"
    * Проверить что автоматически заполнилось поле К снятию через 6 месяцев – "562 566,02"


  Сценарий: Сценарий 2
    * Перейти по ссылке - https://rencredit.ru
    * Перейти в меню "Вклады"
    * Выбрать валюту – "Рубли"
    * Сумма вклада – "500000"
    * Срок вклада в месяцах - "6"
    * Ежемесячное пополнение на сумму - "70000"
    * Отметить чекбокс – "Ежемесячная капитализация","Частичное снятие"
    * Проверить что автоматически заполнилось поле Ставка - "5.65%"
    * Проверить что автоматически заполнилось поле Начислено - "19 107,22"
    * Проверить что автоматически заполнилось поле Пополнение за 6 месяцев - "350 000"
    * Проверить что автоматически заполнилось поле К снятию через 6 месяцев – "869 107,22"